cfe llm/Catalogs/AI_ГруппыПользователей.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_ГруппыПользователей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПользователя</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_ГруппыПользователей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Активна = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователя(Команда)

	СписокПользователей = AI_ДоступКАгентамКлиентСервер.ПолучитьПользователейИнформационнойБазы();
	Если СписокПользователей.Количество() = 0 Тогда
		Сообщить("В информационной базе нет доступных для выбора пользователей.");
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения(
		"ДобавитьПользователяЗавершение",
		ЭтотОбъект);
	ПоказатьВыборИзСписка(
		Оповещение,
		СписокПользователей,
		Элементы.Участники);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователяЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеПользователя = ВыбранноеЗначение.Значение;
	Для Каждого Участник Из Объект.Участники Цикл
		Если Участник.ИдентификаторПользователя = ДанныеПользователя.ИдентификаторПользователя Тогда
			Сообщить("Этот пользователь уже входит в группу.");
			Возврат;
		КонецЕсли;
	КонецЦикла;

	Участник = Объект.Участники.Добавить();
	Участник.ИдентификаторПользователя = ДанныеПользователя.ИдентификаторПользователя;
	Участник.Имя = ДанныеПользователя.Имя;
	Участник.ПолноеИмя = ДанныеПользователя.ПолноеИмя;

КонецПроцедуры
